"use strict";

// touchstart - событие срабатывает при возникновении косания к элементу.
// touchmove - если палец при косании к элементу начинает двигаться по нему, то соответственно каждый раз, при каждом смещении этого пальца будет срабатывать touchmove
// touchend - как только палец оторвался от элемента, то и событие срабатывает
// touchenter - оно будет срабатывать, когда мы ведём пальцем по экрану и при этом наскальзываем на какой-то элемент на которое повешено это событие.
// touchleave - когда наш палец не отторвался от экрана, а продолжил куда-то скользить и ушел куда-то за пределы этого элемента.
// touchcancel - оно срабатывает тогда, когда точка соприкосновения больше не регистрируется на поверхности. Например, мы на мобильном браузере можем что-то серфить и при этом наш палец выйдет за пределы браузера.

window.addEventListener("DOMContentLoaded", () => {
    
});