"use strict";

// Angular:
// - node.js знать не нужно, просто установить
//     - TypeScript его можно быстро освоить если знать javascript
//     - webpack для того, чтобы собрать все модули, собрать все какие-то картинки, какие-то дополнительные сеты и сформировать готовый проект. По началу мы будем использовать готовые сборки, но понимание как это все собирается по отдельным модулям должно быть. В сложных проектах придется самому допиливать свои сборки.
//     - MVC pattern Это шаблон проектирования для создания приложений.Он разделяет логику приложения на визуальную часть, котролирующую и выполняющую какие - то действия.
//     - Angular - всё есть в документации. 

// React:
// - node.js
// - JSX
//     - babel
//     - webpack
// -React

// Vue.js:
// - node.js   
// -webpack
//     - Vue
